#dz №1
# ввод строки
s = input()

# вывод третьего символа строки
print(s[2])

# вывод предпоследнего символа строки
print(s[-2])

# вывод первых пяти символов строки
print(s[:5])

# вывод всей строки, кроме последних двух символов
print(s[:-2])

# вывод всех символов с четными индексами
print(s[::2])

# вывод всех символов с нечетными индексами
print(s[1::2])

# вывод всех символов в обратном порядке
print(s[::-1])

# вывод всех символов строки через один в обратном порядке, начиная с последнего
print(s[-1::-2])

# вывод длины строки
print(len(s))

